public class Quiz02 {

  public static void main(String[] args) {
//    키보드 입력 : Scanner sc = new Scanner(System.in);
//    랜덤 숫자 발생 : int rnd = (int)(Math.random() * 랜덤숫자최대값) + 1;

//    문제 1) int 타입의 배열을 선언하고, 사용자 입력으로 정수 5개를 입력 후 모두 출력하는 프로그램을 작성하세요

//    문제 2) int 타입의 배열(크기 10)을 선언하고 1 ~ 10 까지의 데이터를 모두 입력 후 다시 출력하는 프로그램을 작성하세요
//    for 문을 사용하여 데이터 출력

//    문제 3) 1 ~ 10 까지의 데이터가 저장된 배열을 사용하여 1 ~ 10 까지의 데이터의 총합을 구하는 프로그램을 작성하세요
//    for 문을 사용

//    문제 4) 사용자 입력을 받아 배열에 5개의 정수를 입력하고, 해당 배열의 내용을 모두 출력하는 프로그램을 작성하세요
//    for 문 사용

//    문제 5) 1 ~ 50 까지의 임의의 숫자를 10 개 발생 시킨 후 해당 숫자를 모두 배열에 저장 후 짝수만 모두 출력하는 프로그램을 작성하세요

//    문제 6) 1 ~ 20 까지의 임의의 숫자를 10개 발생 시킨 후 배열에 저장하고, 추가로 사용자가 입력한 숫자와 동일한 숫자가 배열에 몇개 존재 하는지 출력하는 프로그램을 작성하세요

//    문제 7) 크기가 5인 2개의 배열의 생성하고, 임의의 숫자를 5개 생성 후 첫번째 배열에 저장하고, 두번째 배열에는 첫번째 배열의 반대 순서로 데이터를 저장후 첫번째 배열과 두번째 배열의 내용을 모두 출력하는 프로그램을 작성하세요

//    문제 8) 1 ~ 50 까지의 임의의 숫자 10개를 배열에 저장 후 배열의 평균값을 구하고, 해당 평균값보다 큰 숫자만 출력하는 프로그램을 작성하세요
  }
}















