public class Bike2 {

//  생성자 : 자바의 모든 클래스가 가지고 있는 클래스의 객체를 사용할 수 있는 상태로 세팅해줌
//  생성자가 하나도 없을 경우 컴파일러가 기본 생성자를 자동으로 추가함
//  생성자가 하나라도 추가되어 있을 경우 컴파일러가 기본 생성자를 추가하지 않음
//  메소드처럼 매개변수가 있거나 없을 수 있음
//  사용법 :
//    public 클래스명(매개변수1, 매개변수2, ...) {
//      // 초기화에 필요한 소스코드 ... ;
//    }

//  기본 생성자 : 매개변수가 없는 생성자
//  컴파일러가 자동 추가하는 기본 생성자는 코드 블럭의 내용이 없음
//  public Bike2() {
//
//  }

//  사용자 정의 생성자
//  사용자 정의 생성자를 1개라도 추가 시 컴파일러가 기본 생성자를 추가하지 않음
  public Bike2(String color, int cc) {
    
  }
}















